import React, { useState } from "react";
import Header from '../comps/header.jsx';
import Footer from '../comps/footer.jsx';
import './FarmerFAQ.css';

// FarmersFAQ.jsx
const FarmersFAQ = () => {
    const [activeQuestion, setActiveQuestion] = useState(null);
  
    const faqData = [
        {
          question: "איך מצטרפים כחקלאי למערכת?",
          answer: "ההצטרפות למערכת פשוטה ומתחילה במילוי טופס הרשמה באתר שבו תתבקשו לספק את פרטי המשק שלכם. כחלק מתהליך ההרשמה תוכלו להעלות תמונות המייצגות את המשק והפעילות החקלאית, ולהוסיף תיאור קצר של המשק ואופי העבודה המוצעת למתנדבים. לאחר אישור הפרטים תוכלו להתחיל לפרסם הזדמנויות התנדבות במשק שלכם."
        },
      {question: "מי הם המתנדבים? האם יש להם הכשרה מקדימה?",
          answer:" המתנדבים באתר הם אנשים מכל רחבי הארץ המעוניינים לסייע בעבודה חקלאית. ההרשמה להתנדבות היא מגיל 18 ואילך. חלק מהמתנדבים מגיעים עם ניסיון קודם בחקלאות, אך רובם חסרי ניסיון ומונעים בעיקר מרצון לעזור. המתנדבים לא עוברים הכשרה מקדימה דרך האתר, ולכן חשוב שתקדישו זמן בתחילת יום העבודה להדרכה מסודרת והסבר על המשימות הנדרשות."
      },
      {question: "מה המסגרת של יום התנדבות? כמה שעות מקובל?",
          answer: "כל הסכם עבודה בינך לבין המתנדבים הוא מקובל לחלוטין. אנו מבינים שמתחת לזמן מסוים העבודה בשטח פחות אפקטיבית, וזה תלוי כמובן בהחלטתך ובהתאם לגודל הקבוצה וסוג העבודה. על פי הניסיון שלנו יום עבודה רגיל נמשך לרוב סביב 4-5 שעות עבודה נטו, ולכך יש להוסיף את זמן ההדרכה ואת זמני ההפסקות. חשוב לציין מראש את שעות הפעילות המדויקות בעת פרסום ההתנדבות."
      },
      {question: "אילו סוגי עבודות אפשר להציע למתנדבים?",
          answer: "ניתן להציע למתנדבים מגוון עבודות חקלאיות הכוללות קטיף ואיסוף תוצרת, עישוב וניקוי שטחים, שתילה ונטיעה ועבודות תחזוקה קלות. חשוב להקפיד על התאמת המשימות ליכולות של מתנדבים ללא ניסיון ולספק את כל הכלים וההדרכה הנדרשים לביצוע העבודה. יש להימנע מהצעת עבודות מסוכנות או כאלו הדורשות מיומנות מקצועית מיוחדת."
      },
      {question: "האם ניתן לפרסם התנדבות דחופה?",
          answer: "האתר מאפשר פרסום בקשות להתנדבות דחופה, אך חשוב לקחת בחשבון שככל שההתראה קצרה יותר, כך קטן הסיכוי למצוא מתנדבים זמינים. בפרסום התנדבות דחופה חשוב לציין בבירור את הדחיפות ואת הסיבה לה, ומומלץ להיות גמישים עם שעות ההגעה."
      },
      {question: "מה קורה במקרה של ביטול או אי הגעה של מתנדבים?",
          answer: "במקרה של ביטול או אי הגעה של מתנדבים חשוב לעדכן את האתר בהקדם האפשרי. אם מדובר בביטול מראש, נוכל לפרסם מחדש את ההתנדבות ולנסות למצוא מתנדבים חלופיים. במקרה שמגיעים פחות מתנדבים מהצפוי, מומלץ להתאים את היקף העבודה המתוכננת ולשמור על תקשורת פתוחה עם המתנדבים שכן הגיעו. כדי להפחית את הסיכון למקרים כאלה, מומלץ ליצור קשר עם המתנדבים לפני מועד הפעילות, להבהיר את חשיבות ההגעה בזמן כדי לאפשר את ביצוע התוכנית בצורה מיטבית ולגלות בעיות אפשריות מראש. בנוסף, כדאי להכין תוכנית חלופית למקרה שכמות המתנדבים שתגיע לא תאפשר את הפעילות שתוכננה במקור."
      },
      {question: "האם יש המלצות לקליטה מוצלחת של מתנדבים?",
          answer: "כדי להבטיח יום התנדבות מוצלח, מומלץ להכין את השטח והציוד מראש, ולהתחיל במפגש היכרות קצר ובסיור במשק. חשוב להעניק הסבר ברור על המשימות ולהדגים אותן, וללוות את המתנדבים במהלך היום עם פידבק חיובי ותמיכה לפי הצורך. שמרו על הפסקות מסודרות. גישה מכבדת ואכפתית תתרום משמעותית להצלחת ההתנדבות."
      },
      {question: "האם ניתן לקבל מתנדבים באופן קבוע?",
          answer: "בהחלט אפשר ליצור מסגרת של התנדבות קבועה במשק. מומלץ לפרסם מראש תאריכים קבועים להתנדבות ולנסות ליצור קבוצת מתנדבים קבועה. כדאי לבנות תכנית עבודה המתאימה להתנדבות מתמשכת ולשמור על קשר רציף עם המתנדבים הקבועים. התנדבות קבועה היא דרך נהדרת ליצור קהילה תומכת סביב המשק ולבנות מערכת יחסים משמעותית עם המתנדבים."
      },
      {question: "כיצד ניתן להסיר מודעת התנדבות מהאתר?",
        answer: "הסרת פרסום התנדבות מהאתר היא תהליך פשוט. שילחו לנו מייל עם פרטי ההתנדבות שברצונכם להסיר, ובקשתכם תטופל. מיד עם הסרת הפרסום, תישלח אליכם הודעת אישור  לכתובת המייל שלכם. אנו מתחייבים לתת מענה ולטפל בפנייתכם בהקדם האפשרי."
      },
      {question: "האם השימוש באתר כרוך בעלות?",
          answer: "השימוש באתר 'מתנדבים באדמה' הוא חינם לחלוטין, הן עבור החקלאים והן עבור המתנדבים. האתר הוקם במטרה לסייע לחקלאים וליצור חיבור קהילתי בין חקלאים למתנדבים, ולכן אין כל עלות או תשלום עבור פרסום הזדמנויות התנדבות או הרשמה להתנדבות. כל המשתמשים באתר יכולים ליהנות מהשירותים שלנו באופן חופשי."
      }
      ];
  
    return (
      <div class="farmer-faq">
        <Header/>
       <h2>מעוניינים בעזרה? כל התשובות כאן</h2>
       <img src="/faq2.png"  className="faq-image" />
        <div className="faq-list">
          {faqData.map((item, index) => (
            <div key={index} className="faq-item">
              <div 
                className={`faq-question ${activeQuestion === index ? 'active' : ''}`}
                onClick={() => setActiveQuestion(activeQuestion === index ? null : index)}
              >
                {item.question}
              </div>
              {activeQuestion === index && (
                <div className="faq-answer">
                  {item.answer}
                </div>
              )}
            </div>
          ))}
           <div className="contact-us">
        <p>נשארת עם שאלות ללא מענה? אפשר לפנות אלינו במייל, ונשמח לעזור!</p>
    </div>
        </div>

        <Footer/>
        <div className="footer-copyright">
  <p>
    
    Copyright ©{' '}
    <a
      className="web-link"
      href="https://mitnadvimb.il@gmail.com/"
      target="_blank"
      rel="noopener noreferrer"
    >
      מתנדבים באדמה
    </a>
    {` ${new Date().getFullYear()}`}
    <img
      src="/אייקון חטופים.png"
      alt="סמל החטופים"
      className="hostages-icon"
    />
  </p>
</div>
        
      </div>
    );
  };
  
  export {FarmersFAQ };