import React, { useState } from "react";
import Header from '../comps/header.jsx';
import Footer from '../comps/footer.jsx';

import './VolunteerFAQ.css';

const VolunteerFAQ = () => {
    const [activeQuestion, setActiveQuestion] = useState(null);
  
    const faqData = [
      {
        question: "איך מתחילים להתנדב? מה התהליך?",
        answer: 
"התהליך פשוט ונוח - תוכלו לבחור התנדבות שמתאימה לכם דרך המפה האינטראקטיבית או לסנן לפי אזור ברשימת ההתנדבויות. לאחר שמצאתם את ההתנדבות המתאימה, תוכלו להירשם בקלות דרך טופס הרשמה קצר."
      },
    {question: "האם יש דרישות מיוחדות להתנדבות? האם יש הגבלות גיל?",
        answer:
"ההתנדבות פתוחה לכל מי שמעוניין לסייע ויכול לבצע עבודה פיזית קלה עד בינונית. מתנדבים מתחת לגיל 18 נדרשים להגיע עם מלווה מבוגר או כחלק מקבוצה מאורגנת ובאישור הורים. אין צורך בניסיון קודם בחקלאות - החקלאי ילמד אתכם את כל מה שצריך לדעת! העבודה משלבת למידה חווייתית ופעילות בטבע."
    },
    {question: "מה כולל יום התנדבות טיפוסי? כמה שעות עובדים?",
        answer: 
"יום התנדבות מתחיל בדרך כלל בשעות הבוקר ונמשך בין 4-6 שעות, היום מתחיל במפגש עם החקלאי שמסביר על המשק ומדריך לגבי העבודה הנדרשת, לאחר מכן מתחילים בעבודה עם הפסקות מסודרות למנוחה ושתייה, שעות ההתחלה והסיום המדויקות מפורסמות בכל פרסום התנדבות."
    },
    {question: "האם צריך ניסיון קודם בחקלאות?",
        answer: "אין צורך בניסיון קודם בחקלאות כדי להתנדב, החקלאים מכירים בכך שרוב המתנדבים מגיעים ללא רקע חקלאי והם ערוכים להדריך ולהנחות בכל הנוגע לעבודה הנדרשת, הדבר החשוב ביותר הוא הרצון לעזור והנכונות ללמוד דברים חדשים."
    },
    {question: "מה להביא איתי ליום התנדבות?",
        answer: "חשוב להגיע עם בגדים נוחים שמתאימים לעבודה פיזית ושאפשר ללכלך, נעליים סגורות ונוחות, כובע, קרם הגנה, בקבוק מים גדול ואוכל ליום העבודה, מומלץ גם להביא כפפות עבודה אם יש לכם אך ברוב המקרים החקלאים יספקו את הציוד הנדרש לעבודה."
    },
    {question: "מה קורה אם אין באפשרותי להגיע להתנדבות שקבעתי?",
        answer: "אנחנו מבינים שלעתים קורים שינויים בלתי צפויים אך חשוב להודיע מוקדם ככל האפשר על ביטול השתתפות דרך האתר או ישירות לחקלאי, הודעה מראש מאפשרת לחקלאי להיערך בהתאם ולאפשר למתנדבים אחרים להצטרף במקומכם."
    },
    {question: "האם ניתן להתנדב באופן קבוע או חד פעמי?",
        answer: "האתר מאפשר גמישות מלאה בבחירת אופי ההתנדבות, אתם יכולים להתנדב באופן חד פעמי או ליצור קשר קבוע עם משק מסוים ולהגיע אליו באופן סדיר, חקלאים רבים שמחים למתנדבים קבועים שמכירים את המשק ואת אופי העבודה ומצד שני תמיד יש מקום גם להתנדבות חד פעמית."
    },
    {question: "האם מקבלים אישור על שעות התנדבות?",
        answer: "בהחלט, ניתן לבקש מהחקלאי אישור על שעות ההתנדבות שביצעתם במשק, האישור יכול לשמש לצרכי בית ספר, מקום עבודה או כל מטרה אחרת, פשוט ציינו זאת מראש בעת ההרשמה להתנדבות או מול החקלאי לפני ההגעה להתנדבות."
    },
  {question: "כיצד ניתן לבטל הרשמה להתנדבות?",
    answer: "ביטול הרשמה להתנדבות הוא פשוט ומהיר. כל שעליכם לעשות הוא לגשת לדף ההתנדבות הרלוונטי, להזין את כתובת המייל שאיתה נרשמתם, וללחוץ על כפתור 'ביטול הרשמה'. המערכת תטפל בבקשתכם באופן מיידי. עם סיום התהליך, תקבלו מייל לאישור ביטול ההרשמה. במקביל, נדאג לעדכן גם את בעל המשק. "
  },
    {question: "האם השימוש באתר כרוך בעלות?",
        answer: "השימוש באתר 'מתנדבים באדמה' הוא חינם לחלוטין, הן עבור החקלאים והן עבור המתנדבים. האתר הוקם במטרה לסייע לחקלאים וליצור חיבור קהילתי בין חקלאים למתנדבים, ולכן אין כל עלות או תשלום עבור פרסום הזדמנויות התנדבות או הרשמה להתנדבות. כל המשתמשים באתר יכולים ליהנות מהשירותים שלנו באופן חופשי."
    }
    ];

return (
    <div class='volunteer-faq'> 
    
        <Header/>
      <h2>רוצים להתנדב? כל התשובות כאן</h2>
      <img src="/faq2.png"  className="faq-image" />
      <div className="faq-list">
        {faqData.map((item, index) => (
          <div key={index} className="faq-item">
            <div 
  className={`faq-question ${activeQuestion === index ? 'active' : ''}`}
  onClick={() => setActiveQuestion(activeQuestion === index ? null : index)}
>
  {item.question}
</div>
          
            {activeQuestion === index && (
              <div className="faq-answer">
                {item.answer}
              </div>
            )}
          </div>
        ))}
    <div className="contact-us">
        <p>נשארת עם שאלות ללא מענה? אפשר לפנות אלינו במייל, ונשמח לעזור!</p>
    </div>
      </div>
      <Footer/>
      <div className="footer-copyright">
  <p>
    
    Copyright ©{' '}
    <a
      className="web-link"
      href="https://mitnadvimb.il@gmail.com/"
      target="_blank"
      rel="noopener noreferrer"
    >
      מתנדבים באדמה
    </a>
    {` ${new Date().getFullYear()}`}
    <img
      src="/אייקון חטופים.png"
      alt="סמל החטופים"
      className="hostages-icon"
    />
  </p>
</div>
      
    </div>
  );

}

export {VolunteerFAQ };